package Ch02;

/*
	컴퓨터(CPU)는 구조상 덧셈연산을 할 수 있다(o)
	컴퓨터(CPU)는 구조상 뺄셈연산을 할 수 있다(x)
	컴퓨터(CPU)에서 뺄셈요청시 뺄셈처리는 할 수 있다(o)
	보수개념을 도입해서 뺄셈처리를 수행하기 때문에 가능
	
	7 - 4 = 3
	
	7 + 6 = '1'3  '10제거' = 3
	
	77 - 32 = 45
	77 + 68 = 145 = '100'제거 = 45
	
	0000 0101 = 5
  + 1111 1011 = -5(2의 보수)
   ------------------
 '1'0000 0000  = 0	증가한 자릿수 '1' 제거
 
	0000 0101 = 5
  + 1111 1010 = -6(1의 보수)
  + 0000 0001 = 1
   ------------------
 '1'0000 0000  = 0	증가한 자릿수 
*/

public class C02음수 {

	public static void main(String[] args) {

		
	}

}
